src/posts/pe.org
# -*- buffer-auto-save-file-name: nil; -*-
#+TITLE: Project Euler solutions

** Disclaimer

This file contains my BQN solutions to some of the problems on Project Euler.
Since I don't want to spoil the fun for anyone, I've encrypted them. I will not
blog about it, but I am happy to discuss the solutions with anyone who is
interested. Plus, I am not a fan of writing throw away code.

** PE1 :crypt:

-----BEGIN PGP MESSAGE-----

hF4Djmgxy0OJ4GASAQdAuaSwHXE4kAY9BJQL6qiuNsPbUBQaCR31ZE2QSFmisgcw
QZ4De9GtYfd2FhMExeI50NahHWQt/8KFvYdlZOguPNgpsrN3qp8RRpb8SVwJgmai
0o0BVUGJURxSGdY7GTIe1RmT2yJmyFPGyxv+u6f8fzKERN5BVRtERv2JruNfqbIk
9bY9vmf1x+ljlSLHksv34q+SeXRMONjqchc25w5wcs/TKuD6UY8T6RTPkpKtjCeI
O4JozPA7oa0IrwnxIirLUQom8DbSh1GW2l+wD4mg+4VevewSHrFrkGdagJm4JVo=
=7c/2
-----END PGP MESSAGE-----

** PE2 :crypt:

-----BEGIN PGP MESSAGE-----

hF4Djmgxy0OJ4GASAQdAl0LyDVuRi68NGukJhQZLIk3FQQ6oMf1FfCiF+CzkYV4w
IsxduTNbL7lqvO3Sn8yJQ24R6LzLU/RajK1QTjUFnnoDItgbIoAzBvUDEjlXdtOF
0sA6Adv7h8e6DI0dWiJaG4VvODTYVURENi4EigzjYnTJAtX6m6A6eziuBtMbVRU8
uvS/kJ9kn6yLeKjKMdn6yoFW4ORWl0MyCYrrxZ2G25/vB8kGIdMnGbzg/zREyn6L
+DCFfbIFl4Vn7rmpjZlHqIU2u4E6544ueJ7uZbw5uVG3tLZMz8Eu5aXpt8wBGZtq
Px+rL2EaVFGjqdX1ceyzyW2GWzDCuIC1V0pjYnFlZE6ZIaVFGDqOdjBptBnjgT4K
henGe83UHOJs58ft/MiIkSRPJ5GW0J+d+X6qnyi/MShqnnKxbozsbHsDb7lBKX4K
0OaAUePTvzxJe7lV5Q==
=hXZI
-----END PGP MESSAGE-----

** PE3 :crypt:

-----BEGIN PGP MESSAGE-----

hF4Djmgxy0OJ4GASAQdAnwFU79Kt8xBrWmUrP4Tj9veQ950HBkXf3lRSM62WiVUw
455/Ep4qv/OTX/idW6+lCaiIp1Qy+aPrOTBY9Tt7aCyL+cfAgB255nrr2Q7mGmqZ
0ukBP9kcmXKSx2mZuOyHnJ1K36SmyJ8MGI5C+eN2E83615rr/MSZlUsiaBfh/NbX
lmrCjxXP234Ch1im4etB67Q5aB4+lyQ42+qedYULh6SNOO9atPsNm+uhZOv2RQOB
4dPVTGGlcC+aw27toZb384RS/6lk08Cn6yiV5SE80ZaKoVP4Gh2cpxk1c8H2/V0j
hzo1ici8J1Aqbt5kmxL95Hxyvg3Fas7YsBY5H0n9sohltxaKxKJbHcpX5WhRQlXh
+NSdVJq0xXo/n1sPl8rMwvmtB3pAuQkCTQgwRXCPMLoAOoubYbtxdrqXxAzZOBoA
z3LMSMIrba0MpWlwV/raABS9NkvQig9FkPylzIvXIcpQykf/k1P6X5FpczjEFaF1
ty08duRMp5RddLhLkemNsGyetpFIeYd+Bb0fZI0UopbPZFtiVYR+sh/zvrCNomT7
iXHKFIeLcUT19ej0hO8uW8W43AKeZbzH4eKpiUE70xctiwxFdaNaVAspIAt6QuuQ
JnmLA0HFQ2WHenu6bGWUT0XDB4NSn98MOEfLVNzzjqeji1R033UX3JP27cbswT0Y
ihZ4bbrF+FzAlckGAiC5SJKpVE/dURBxVwK6sHvJvov9LjgByeAwGgniqsDq01y8
zLiVNY/DlibT6XSccxlsscSqxHoTeID9GsV/kqyaWdS1dpHMgwRk/bqkzlJ0M4J5
u2rIzuj/jmeNL1kXh3B1VRjTuBIMTP5eT43owHy0Vk7MNwLazl2DW7RhLynJLs3r
+74TfYci35tj4YpZOE5umT5FQtXWa7uACluJFs/Fb0Gn00OVwsV+MX6i4S6ub/JM
ycHiIfdLAlGAreoZ/Ou2y8bv4BXeHPa2fmt5+hQk0EH6ZF45
=9XUt
-----END PGP MESSAGE-----
