posts/pe.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project Euler solutions</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Project Euler solutions</h1>
<div id="outline-container-org24da42d" class="outline-2">
<h2 id="org24da42d">Disclaimer</h2>
<div class="outline-text-2" id="text-org24da42d">
<p>
This file contains my BQN solutions to some of the problems on Project Euler.
Since I don't want to spoil the fun for anyone, I've encrypted them. I will not
blog about it, but I am happy to discuss the solutions with anyone who is
interested. Plus, I am not a fan of writing throw away code.
</p>
</div>
</div>
<div id="outline-container-org2f319ff" class="outline-2">
<h2 id="org2f319ff">PE1&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crypt">crypt</span></span></h2>
<div class="outline-text-2" id="text-org2f319ff">
<p>
&#x2013;&#x2014;BEGIN PGP MESSAGE&#x2013;&#x2014;
</p>

<p>
hF4Djmgxy0OJ4GASAQdAuaSwHXE4kAY9BJQL6qiuNsPbUBQaCR31ZE2QSFmisgcw
QZ4De9GtYfd2FhMExeI50NahHWQt/8KFvYdlZOguPNgpsrN3qp8RRpb8SVwJgmai
0o0BVUGJURxSGdY7GTIe1RmT2yJmyFPGyxv+u6f8fzKERN5BVRtERv2JruNfqbIk
9bY9vmf1x+ljlSLHksv34q+SeXRMONjqchc25w5wcs/TKuD6UY8T6RTPkpKtjCeI
O4JozPA7oa0IrwnxIirLUQom8DbSh1GW2l+wD4mg+4VevewSHrFrkGdagJm4JVo=
=7c/2
&#x2013;&#x2014;END PGP MESSAGE&#x2013;&#x2014;
</p>
</div>
</div>
<div id="outline-container-org9847f6d" class="outline-2">
<h2 id="org9847f6d">PE2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crypt">crypt</span></span></h2>
<div class="outline-text-2" id="text-org9847f6d">
<p>
&#x2013;&#x2014;BEGIN PGP MESSAGE&#x2013;&#x2014;
</p>

<p>
hF4Djmgxy0OJ4GASAQdAl0LyDVuRi68NGukJhQZLIk3FQQ6oMf1FfCiF+CzkYV4w
IsxduTNbL7lqvO3Sn8yJQ24R6LzLU/RajK1QTjUFnnoDItgbIoAzBvUDEjlXdtOF
0sA6Adv7h8e6DI0dWiJaG4VvODTYVURENi4EigzjYnTJAtX6m6A6eziuBtMbVRU8
uvS/kJ9kn6yLeKjKMdn6yoFW4ORWl0MyCYrrxZ2G25/vB8kGIdMnGbzg/zREyn6L
+DCFfbIFl4Vn7rmpjZlHqIU2u4E6544ueJ7uZbw5uVG3tLZMz8Eu5aXpt8wBGZtq
Px+rL2EaVFGjqdX1ceyzyW2GWzDCuIC1V0pjYnFlZE6ZIaVFGDqOdjBptBnjgT4K
henGe83UHOJs58ft/MiIkSRPJ5GW0J+d+X6qnyi/MShqnnKxbozsbHsDb7lBKX4K
0OaAUePTvzxJe7lV5Q==
=hXZI
&#x2013;&#x2014;END PGP MESSAGE&#x2013;&#x2014;
</p>
</div>
</div>
<div id="outline-container-org1c49a10" class="outline-2">
<h2 id="org1c49a10">PE3&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crypt">crypt</span></span></h2>
<div class="outline-text-2" id="text-org1c49a10">
<p>
&#x2013;&#x2014;BEGIN PGP MESSAGE&#x2013;&#x2014;
</p>

<p>
hF4Djmgxy0OJ4GASAQdAnwFU79Kt8xBrWmUrP4Tj9veQ950HBkXf3lRSM62WiVUw
455/Ep4qv/OTX/idW6+lCaiIp1Qy+aPrOTBY9Tt7aCyL+cfAgB255nrr2Q7mGmqZ
0ukBP9kcmXKSx2mZuOyHnJ1K36SmyJ8MGI5C+eN2E83615rr/MSZlUsiaBfh/NbX
lmrCjxXP234Ch1im4etB67Q5aB4+lyQ42+qedYULh6SNOO9atPsNm+uhZOv2RQOB
4dPVTGGlcC+aw27toZb384RS/6lk08Cn6yiV5SE80ZaKoVP4Gh2cpxk1c8H2/V0j
hzo1ici8J1Aqbt5kmxL95Hxyvg3Fas7YsBY5H0n9sohltxaKxKJbHcpX5WhRQlXh
+NSdVJq0xXo/n1sPl8rMwvmtB3pAuQkCTQgwRXCPMLoAOoubYbtxdrqXxAzZOBoA
z3LMSMIrba0MpWlwV/raABS9NkvQig9FkPylzIvXIcpQykf/k1P6X5FpczjEFaF1
ty08duRMp5RddLhLkemNsGyetpFIeYd+Bb0fZI0UopbPZFtiVYR+sh/zvrCNomT7
iXHKFIeLcUT19ej0hO8uW8W43AKeZbzH4eKpiUE70xctiwxFdaNaVAspIAt6QuuQ
JnmLA0HFQ2WHenu6bGWUT0XDB4NSn98MOEfLVNzzjqeji1R033UX3JP27cbswT0Y
ihZ4bbrF+FzAlckGAiC5SJKpVE/dURBxVwK6sHvJvov9LjgByeAwGgniqsDq01y8
zLiVNY/DlibT6XSccxlsscSqxHoTeID9GsV/kqyaWdS1dpHMgwRk/bqkzlJ0M4J5
u2rIzuj/jmeNL1kXh3B1VRjTuBIMTP5eT43owHy0Vk7MNwLazl2DW7RhLynJLs3r
+74TfYci35tj4YpZOE5umT5FQtXWa7uACluJFs/Fb0Gn00OVwsV+MX6i4S6ub/JM
ycHiIfdLAlGAreoZ/Ou2y8bv4BXeHPa2fmt5+hQk0EH6ZF45
=9XUt
&#x2013;&#x2014;END PGP MESSAGE&#x2013;&#x2014;
</p>
</div>
</div>
</div>
</body>
</html>
